// 179	1001	77	新华街道党群服务中心
// 180	1001	77	北苑街道万达党群服务中心
// 180	1003	77	北苑街道万达党群服务中心
// 181	1001	77	北苑街道官园党群服务中心
// 182	1003	77	北苑街道万达商圈党群服务站
// 182	1006	77	北苑街道万达商圈党群服务站
// 183	1001	77	中仓街道党群服务中心
// 184	1001	77	中仓街道南大街地区党群服务中心
// 185	1004	77	中仓街道佟麟阁社区网格党群服务站
// 186	1005	77	中仓街道运河西岸党群服务站
// 187	1001	77	玉桥街道玉桥西里党群服务中心
// 187	1008	77	玉桥街道玉桥西里党群服务中心
// 188	1001	77	玉桥街道运河大街党群服务中心
// 188	1004	77	玉桥街道运河大街党群服务中心
// 189	1001	77	潞源街道党群服务中心
// 189	1004	77	潞源街道党群服务中心
// 190	1004	77	潞源街道朗清园南社区党群服务中心
// 191	1001	77	通运街道党群服务中心
// 191	1008	77	通运街道党群服务中心
// 192	1001	77	文景街道党群服务中心
// 192	1005	77	文景街道党群服务中心
// 193	1001	77	九棵树街道党群服务中心
// 193	1003	77	九棵树街道党群服务中心
// 194	1001	77	临河里街道党群服务中心
// 195	1004	77	临河里街道运河滨江社区党群服务中心
// 196	1001	77	杨庄街道党群服务中心
// 197	1008	77	杨庄街道怡乐园社区党群服务中心
// 198	1001	77	潞邑街道党群服务中心
// 199	1004	77	潞邑街道通瑞嘉苑社区党群服务中心
// 200	1002	77	永顺镇党群服务中心
// 200	1004	77	永顺镇党群服务中心
// 201	1002	77	梨园镇党群服务中心
// 201	1004	77	梨园镇党群服务中心
// 202	1008	77	梨园镇新城乐居社区党群服务中心
// 203	1002	77	宋庄镇党群服务中心
// 204	1002	77	宋庄艺术区党群服务中心
// 204	1005	77	宋庄艺术区党群服务中心
// 205	1004	77	宋庄镇含章园二社区党群服务中心
// 206	1002	77	潞城镇党群服务中心
// 206	1007	77	潞城镇党群服务中心
// 207	1007	77	潞城镇前疃村党群服务中心
// 208	1002	77	西集镇党群服务中心
// 209	1007	77	西集镇田间学校党群服务中心
// 210	1007	77	西集镇红樱党群服务中心
// 211	1003	77	漷县镇医药健康产业园党群服务中心
// 211	1006	77	漷县镇医药健康产业园党群服务中心
// 212	1002	77	漷县镇党群服务中心
// 213	1007	77	漷县镇马头村党群服务中心
// 214	1002	77	张家湾镇党群服务中心
// 214	1008	77	张家湾镇党群服务中心
// 215	1007	77	张家湾镇苍上村党群服务中心
// 216	1002	77	台湖镇党群服务中心
// 217	1002	77	台湖镇环影宿游党群服务中心
// 217	1005	77	台湖镇环影宿游党群服务中心
// 218	1002	77	马驹桥镇党群服务中心
// 218	1004	77	马驹桥镇党群服务中心
// 219	1004	77	马驹桥镇南五村党群服务中心
// 220	1002	77	永乐店镇党群服务中心
// 220	1007	77	永乐店镇党群服务中心
// 221	1007	77	永乐店镇西槐庄村党群服务中心
// 222	1002	77	于家务回族乡党群服务中心
// 223	1007	77	于家务回族乡仇庄村党群服务中心
// 224	1007	77	于家务回族乡南三间房村党群服务中心
// 225	1003	77	中关村通州园党群服务中心
// 225	1006	77	中关村通州园党群服务中心
// 226	1003	77	运河商务区党群服务中心
// 226	1006	77	运河商务区党群服务中心
// 227	1000	77	北京城市副中心党群服务中心
// 233	1007	77	永乐店镇西槐庄科技小院党群服务中心

export const siteAllMap = {
  179: { siteId: 179, typeIds: "1001", siteName: "新华街道党群服务中心", siteCoord: { x: 4050, y: 2550 } },
  180: { siteId: 180, typeIds: "1001,1003", siteName: "北苑街道万达党群服务中心", siteCoord: { x: 3600, y: 2820 } },
  181: { siteId: 181, typeIds: "1001", siteName: "北苑街道官园党群服务中心", siteCoord: { x: 3680, y: 2940 } },
  182: { siteId: 182, typeIds: "1003,1006", siteName: "北苑街道万达商圈党群服务站", siteCoord: { x: 3740, y: 2820 } },
  183: { siteId: 183, typeIds: "1001", siteName: "中仓街道党群服务中心", siteCoord: { x: 3900, y: 2880 } },
  184: { siteId: 184, typeIds: "1001", siteName: "中仓街道南大街地区党群服务中心", siteCoord: { x: 4010, y: 2880 } },
  185: { siteId: 185, typeIds: "1004", siteName: "中仓街道佟麟阁社区网格党群服务站", siteCoord: { x: 4130, y: 2880 } },
  186: { siteId: 186, typeIds: "1005", siteName: "中仓街道运河西岸党群服务站", siteCoord: { x: 4250, y: 2880 } },
  187: { siteId: 187, typeIds: "1001,1008", siteName: "玉桥街道玉桥西里党群服务中心", siteCoord: { x: 4010, y: 3180 } },
  188: { siteId: 188, typeIds: "1001,1004", siteName: "玉桥街道运河大街党群服务中心", siteCoord: { x: 4210, y: 3180 } },
  189: { siteId: 189, typeIds: "1001,1004", siteName: "潞源街道党群服务中心", siteCoord: { x: 4650, y: 2760 } },
  190: { siteId: 190, typeIds: "1004", siteName: "潞源街道朗清园南社区党群服务中心", siteCoord: { x: 4840, y: 2760 } },
  191: { siteId: 191, typeIds: "1001,1008", siteName: "通运街道党群服务中心", siteCoord: { x: 4450, y: 2660 } },
  192: { siteId: 192, typeIds: "1001,1005", siteName: "文景街道党群服务中心", siteCoord: { x: 3900, y: 3900 } },
  193: { siteId: 193, typeIds: "1001,1003", siteName: "九棵树街道党群服务中心", siteCoord: { x: 3740, y: 3250 } },
  194: { siteId: 194, typeIds: "1001", siteName: "临河里街道党群服务中心", siteCoord: { x: 4380, y: 3290 } },
  195: { siteId: 195, typeIds: "1004", siteName: "临河里街道运河滨江社区党群服务中心", siteCoord: { x: 4500, y: 3290 } },
  196: { siteId: 196, typeIds: "1001", siteName: "杨庄街道党群服务中心", siteCoord: { x: 3320, y: 3000 } },
  197: { siteId: 197, typeIds: "1008", siteName: "杨庄街道怡乐园社区党群服务中心", siteCoord: { x: 3480, y: 3000 } },
  198: { siteId: 198, typeIds: "1001", siteName: "潞邑街道党群服务中心", siteCoord: { x: 4150, y: 2190 } },
  199: { siteId: 199, typeIds: "1004", siteName: "潞邑街道通瑞嘉苑社区党群服务中心", siteCoord: { x: 4270, y: 2190 } },
  200: { siteId: 200, typeIds: "1002,1004", siteName: "永顺镇党群服务中心", siteCoord: { x: 3650, y: 2600 } },
  201: { siteId: 201, typeIds: "1002,1004", siteName: "梨园镇党群服务中心", siteCoord: { x: 3460, y: 3620 } },
  202: { siteId: 202, typeIds: "1008", siteName: "梨园镇新城乐居社党群服务中心", siteCoord: { x: 3960, y: 3620 } },
  203: { siteId: 203, typeIds: "1002", siteName: "宋庄镇党群服务中心", siteCoord: { x: 4800, y: 1920 } },
  204: { siteId: 204, typeIds: "1002,1005", siteName: "宋庄艺术区党群服务中心", siteCoord: { x: 4600, y: 1760 } },
  205: { siteId: 205, typeIds: "1004", siteName: "宋庄镇含章园二社区党群服务中心", siteCoord: { x: 4600, y: 2120 } },
  206: { siteId: 206, typeIds: "1002,1007", siteName: "潞城镇党群服务中心", siteCoord: { x: 5700, y: 4220 } },
  207: { siteId: 207, typeIds: "1007", siteName: "潞城镇前疃村党群服务中心", siteCoord: { x: 6060, y: 3620 } },
  208: { siteId: 208, typeIds: "1002", siteName: "西集镇党群服务中心", siteCoord: { x: 6480, y: 4820 } },
  209: { siteId: 209, typeIds: "1007", siteName: "西集镇田间学校党群服务中心", siteCoord: { x: 7280, y: 5100 } },
  210: { siteId: 210, typeIds: "1007", siteName: "西集镇红樱党群服务中心", siteCoord: { x: 6740, y: 5520 } },
  211: { siteId: 211, typeIds: "1003,1006", siteName: "漷县镇医药健康产业园党群服务中心", siteCoord: { x: 5600, y: 6360 } },
  212: { siteId: 212, typeIds: "1002", siteName: "漷县镇党群服务中心", siteCoord: { x: 5600, y: 5760 } },
  213: { siteId: 213, typeIds: "1007", siteName: "漷县镇马头村党群服务中心", siteCoord: { x: 7020, y: 6260 } },
  214: { siteId: 214, typeIds: "1002,1008", siteName: "张家湾镇党群服务中心", siteCoord: { x: 4940, y: 3660 } },
  215: { siteId: 215, typeIds: "1007", siteName: "张家湾镇苍上村党群服务中心", siteCoord: { x: 4900, y: 5600 } },
  216: { siteId: 216, typeIds: "1002", siteName: "台湖镇党群服务中心", siteCoord: { x: 2820, y: 5320 } },
  217: { siteId: 217, typeIds: "1002,1005", siteName: "台湖镇环影宿游党群服务中心", siteCoord: { x: 3460, y: 5400 } },
  218: { siteId: 218, typeIds: "1002,1004", siteName: "马驹桥镇党群服务中心", siteCoord: { x: 2520, y: 6360 } },
  219: { siteId: 219, typeIds: "1004", siteName: "马驹桥镇南五村党群服务中心", siteCoord: { x: 2260, y: 6560 } },
  220: { siteId: 220, typeIds: "1002,1007", siteName: "永乐店镇党群服务中心", siteCoord: { x: 5780, y: 7360 } },
  221: { siteId: 221, typeIds: "1007", siteName: "永乐店镇西槐庄村党群服务中心", siteCoord: { x: 6460, y: 7560 } },
  222: { siteId: 222, typeIds: "1002", siteName: "于家务回族乡党群服务中心", siteCoord: { x: 4500, y: 7040 } },
  223: { siteId: 223, typeIds: "1007", siteName: "于家务回族乡仇庄村党群服务中心", siteCoord: { x: 4660, y: 8400 } },
  224: { siteId: 224, typeIds: "1007", siteName: "于家务回族乡南三间房村党群服务中心", siteCoord: { x: 5060, y: 7580 } },
  225: { siteId: 225, typeIds: "1003,1006", siteName: "中关村通州园党群服务中心", siteCoord: { x: 4640, y: 3660 } },
  226: { siteId: 226, typeIds: "1003,1006", siteName: "运河商务区党群服务中心", siteCoord: { x: 3975, y: 2690 } },
  227: { siteId: 227, typeIds: "1000", siteName: "北京城市副中心党群服务中心", siteCoord: { x: 3900, y: 2550 } },
};

export const siteTzTagTypeMap = {
  1000: { tagId: "1000", tagName: "区级" },
  1001: { tagId: "1001", tagName: "街道级" },
  1002: { tagId: "1002", tagName: "乡镇级" },
  1003: { tagId: "1003", tagName: "园区级" },
  1004: { tagId: "1004", tagName: "民生服务型" },
  1005: { tagId: "1005", tagName: "文旅辐射型" },
  1006: { tagId: "1006", tagName: "园区助企型" },
  1007: { tagId: "1007", tagName: "乡村振兴型" },
  1008: { tagId: "1008", tagName: "治理融合型" },
};
